minishell> # **************************************************************************** #
# :command not found
minishell> #                                COMPARE PARSING                               #
# :command not found
minishell> # **************************************************************************** #
# :command not found
minishell> 
minishell> ### comparing your input parsing to bash ###
### :command not found
minishell> /bin/echo ""$?""
$?
minishell> 
minishell> /bin/echo $?"42"
$?42
minishell> 
minishell> /bin/echo ''$?''"42"
$?42
minishell> 
minishell> /bin/echo '"$USER"'
"$USER"
minishell> 
minishell> /bin/echo "'$USER'"
'codespace'
minishell> 
minishell> /bin/echo ""'$USER'""
$USER
minishell> 
minishell> /bin/echo '"'$USER'"'
"codespace"
minishell> 
minishell> /bin/echo "''$USER''"
''codespace''
minishell> 
minishell> /bin/echo "'"'$USER'"'"
'$USER'
minishell> 
minishell> /bin/echo '"'"$USER"'"'
"codespace"
minishell> 
minishell> /bin/echo $"HOME"$USER
$HOMEcodespace
minishell> 
minishell> /bin/echo $"HOM"E$USER
$HOMEcodespace
minishell> 
minishell> /bin/echo "exit_code ->$? user ->$USER home -> $HOME"
exit_code ->$? user ->codespace home -> /home/codespace
minishell> 
minishell> /bin/echo $"HOME"
$HOME
minishell> 
minishell> /bin/echo $"42$"
$42$
minishell> 
minishell> /bin/echo "$ "
$ 
minishell> 
minishell> /bin/echo hi >./outfiles/outfile01 | /bin/echo bye
open out: No such file or directory
bye
minishell> 
minishell> /bin/echo <123 <456 hi | /bin/echo 42
open in: No such file or directory
42
minishell> 
minishell> /bin/echo '$='
$=
minishell> 
minishell> /bin/echo '$ '
$ 
minishell> 
minishell> /bin/echo "$?"
$?
minishell> 
minishell> /bin/echo '$?'
$?
minishell> 
minishell> /bin/echo "'$?'"
'$?'
minishell> 
minishell> /bin/echo \$USER
\codespace
minishell> 
minishell> /bin/echo \\$USER
\\codespace
minishell> 
minishell> /bin/echo \\\$USER
\\\codespace
minishell> 
minishell> /bin/echo \\\\$USER
\\\\codespace
minishell> 
minishell> /bin/echo \\\\\$USER
\\\\\codespace
minishell> 
minishell> /bin/echo \\\\\\\\\$USER
\\\\\\\\\codespace
minishell> 
minishell> /bin/echo \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\$USER \$PATH \\$PWD
\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\codespace \/usr/local/rvm/gems/ruby-3.4.1/bin:/usr/local/rvm/gems/ruby-3.4.1@global/bin:/usr/local/rvm/rubies/ruby-3.4.1/bin:/vscode/bin/linux-x64/488a1f239235055e34e673291fb8d8c810886f81/bin/remote-cli:/home/codespace/.local/bin:/home/codespace/.dotnet:/home/codespace/nvm/current/bin:/home/codespace/.php/current/bin:/home/codespace/.python/current/bin:/home/codespace/java/current/bin:/home/codespace/.ruby/current/bin:/home/codespace/.local/bin:/usr/local/python/current/bin:/usr/local/py-utils/bin:/usr/local/jupyter:/usr/local/oryx:/usr/local/go/bin:/go/bin:/usr/local/sdkman/bin:/usr/local/sdkman/candidates/java/current/bin:/usr/local/sdkman/candidates/gradle/current/bin:/usr/local/sdkman/candidates/maven/current/bin:/usr/local/sdkman/candidates/ant/current/bin:/usr/local/rvm/gems/default/bin:/usr/local/rvm/gems/default@global/bin:/usr/local/rvm/rubies/default/bin:/usr/local/share/rbenv/bin:/usr/local/php/current/bin:/opt/conda/bin:/usr/local/nvs:/usr/local/share/nvm/versions/node/v22.17.0/bin:/usr/local/hugo/bin:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/share/dotnet:/home/codespace/.dotnet/tools:/usr/local/rvm/bin \\/workspaces/Minishel
minishell> 
minishell> /bin/echo "cat lol.c | cat > lol.c"
cat lol.c | cat > lol.c
minishell> 
minishell> /bin/echo "cat lol.c '|' cat > lol.c"
cat lol.c '|' cat > lol.c
minishell> 
minishell> /bin/echo '$USER' "$USER" "text  ' text"
$USER codespace text  ' text
minishell> 
minishell> /bin/echo $USER =intergalaktikus miaf*szomez
codespace =intergalaktikus miaf*szomez
minishell> 
minishell> /bin/echo -n"-n" bonjour
-n-n bonjour
minishell> 
minishell> /bin/echo "'$USER'"
'codespace'
minishell> 
minishell> /bin/echo " '$USER' "
 'codespace' 
minishell> 
minishell> /bin/echo text"$USER"
textcodespace
minishell> 
minishell> /bin/echo text"'$USER'" ' $USER '
text'codespace'  $USER 
minishell> 
minishell> /bin/echo "text"   "$USER"    "$USER"
text codespace codespace
minishell> 
minishell> /bin/echo '              $USER          '
              $USER          
minishell> 
minishell> /bin/echo ''''''''''$USER''''''''''
codespace
minishell> 
minishell> /bin/echo """"""""$USER""""""""
codespace
minishell> 
minishell> /bin/echo '""""""""$USER""""""""'
""""""""$USER""""""""
minishell> 
minishell> /bin/echo ""'""""""$USER""""""'""
""""""$USER""""""
minishell> 
minishell> /bin/echo """"""""'$USER'""""""""
$USER
minishell> 
minishell> /bin/echo """""""'"$USER"'"""""""
'codespace'
minishell> 
minishell> /bin/echo """"""'""$USER""'""""""
""$USER""
minishell> 
minishell> /bin/echo ""'""'""""$USER""""'""'""
""codespace""
minishell> 
minishell> /bin/echo '""'""'""""$USER""""'""'""'
""""""$USER""""""
minishell> 
minishell> /bin/echo $USER'$USER'text oui oui     oui  oui $USER oui      $USER ''
codespace$USERtext oui oui oui oui codespace oui codespace 
minishell> 
minishell> /bin/echo "text" "text$USER" ... "$USER"
text textcodespace ... codespace
minishell> 
minishell> /bin/echo

minishell> 
minishell> /bin/echo ''

minishell> 
minishell> /bin/echo ""

minishell> 
minishell> /bin/echo '' ""
 
minishell> 
minishell> /bin/echo /bin/echo
/bin/echo
minishell> 
minishell> /bin/echo test1
test1
minishell> 
minishell> /bin/echo 'test1'
test1
minishell> 
minishell> /bin/echo "/bin/echo hallo"
/bin/echo hallo
minishell> 
minishell> /bin/echo /bin/echo"1"
/bin/echo1
minishell> 
minishell> /bin/echo "test1 test2"
test1 test2
minishell> 
minishell> /bin/echo "test1  test2" test3
test1  test2 test3
minishell> 
minishell> /bin/echo " test1 test2 " 'test3 '
 test1 test2  test3 
minishell> 
minishell> /bin/echo test1test2
test1test2
minishell> 
minishell> /bin/echo $USER$TESTNOTFOUND$HOME$
codespace/home/codespace$
minishell> 
minishell> /bin/echo $USER$TESTNOTFOUND$HOME$WTF$PWD
codespace/home/codespace/workspaces/Minishel
minishell> 
minishell> /bin/echo -n test1
test1minishell> 
minishell> /bin/echo -n "test1 test2"
test1 test2minishell> 
minishell> /bin/echo -n "test1 test2" test3
test1 test2 test3minishell> 
minishell> /bin/echo -n " test1 test2 " 'test3 '
 test1 test2  test3 minishell> 
minishell> /bin/echo -n test1test2
test1test2minishell> 
minishell> /bin/echo test1 -n
test1 -n
minishell> 
minishell> /bin/echo "test1 -n"
test1 -n
minishell> 
minishell> /bin/echo -n -n test1
test1minishell> 
minishell> /bin/echo -n -n -n -n -n test1
test1minishell> 
minishell> /bin/echo "  -nn "
  -nn 
minishell> 
minishell> /bin/echo "-n test1 -n test2"
-n test1 -n test2
minishell> 
minishell> /bin/echo "test1 -n test2"
test1 -n test2
minishell> 
minishell> /bin/echo ~42
~42
minishell> 
minishell> /bin/echo -n -n -nasd
-nasdminishell> 
minishell> /bin/echo -n -n -n-nnnnn
-n-nnnnnminishell> 
minishell> /bin/echo -n -nnnnnnn -n -nnn -nnnnn -n-n
-n-nminishell> 
minishell> /bin/echo -n -nnnnnnn -n -nnn -nnnnn -n feel my pain
feel my painminishell> 
minishell> /bin/echo -n -n -n-n
-n-nminishell> 
minishell> /bin/echo "'totally logical'"
'totally logical'
minishell> 
minishell> /bin/echo 'totally logical'
totally logical
minishell> 
minishell> /bin/echo ''totally logical''
totally logical
minishell> 
minishell> /bin/echo ""'totally logical'""# **************************************************************************** #
totally logical# **************************************************************************** #
minishell> #                                PARSING HELL                                  #
# :command not found
minishell> # **************************************************************************** #
# :command not found
minishell> 
minishell> ">>" asd
>> :command not found
minishell> 
minishell> >">" asd
asd :command not found
minishell> /bin/rm -f ">"
minishell> 
minishell> >> '$USER'
minishell> cat $USER
cat: codespace: No such file or directory
minishell> /bin/rm -f '$USER'
minishell> 
minishell> >> '$USER'
minishell> cat '$USER'
minishell> /bin/rm -f '$USER'
minishell> 
minishell> "echo "
echo  :command not found
minishell> 
minishell> "echo -nnnnn"
echo -nnnnn :command not found
minishell> 
minishell> "ECho" -n -nnn"" "-"nnnnn
ECho :command not found
minishell> 
minishell> "ECHO" "-n"
ECHO :command not found
minishell> 
minishell> ECHO '''''-''n'
ECHO :command not found
minishell> 
minishell> echo '' -n
 -n
minishell> 
minishell> echo "" "" "" -n -n -n -n
   -n -n -n -n
minishell> 
minishell> cat << $USER
> why
> not
> $USER
why
not
minishell> 
minishell> export T=">>"
minishell> $T lol
>> :command not found
minishell> 
minishell> cat << "$USER"
> why
> not
> $USER
why
not
minishell> 
minishell> cat << "$US"E"R"
> because
> we
> love
> bash
> $USER
because
we
love
bash
minishell> 
minishell> >> $HOME
open out: Is a directory


/home/codespace
minishell> 
minishell> >> "$H"OM"E"
minishell> cat OME
minishell> /bin/rm -f OME
minishell> 
minishell> >> "$USER'$USER'"
minishell> cat "$USER'$USER'"
minishell> /bin/rm -f "$USER'$USER'"
minishell> 
minishell> >> "$USER"
minishell> cat $USER
minishell> /bin/rm -f $USER
minishell> 
minishell> cd $HOME/Desktop/
/home/codespace/Desktop/: No such file or directory
minishell> pwd
/workspaces/Minishel
minishell> 
minishell> cd "$HOME"/Desktop/
/home/codespace/Desktop/: No such file or directory
minishell> pwd
/workspaces/Minishel
minishell> 
minishell> cd "$H"O"ME"/Desktop/
OME/Desktop/: No such file or directory
minishell> echo $?
$?
minishell> 
minishell> export T=n
minishell> echo "-"$T$T
minishell> 
minishell> export T=ech
minishell> echo $To

minishell> 
minishell> export T=ech
minishell> echo $T"o"
echo
minishell> 
minishell> export T=ech
minishell> echo $T"o "
echo 
minishell> 
minishell> export T=ech
minishell> echo $T"o -n"
echo -n
minishell> 
minishell> export T=ech
minishell> echo $T"o -n"
echo -n
minishell> 
minishell> export T=ech
minishell> echo $T'o'
echo
minishell> 
minishell> export T="-n test1 -n test 2"
minishell> echo $T
-n test1 -n test 2
minishell> 
minishell> export T=ech
minishell> echo $T'o '
echo 
minishell> 
minishell> "ECHO"
ECHO :command not found
minishell> 
minishell> 'echo'

minishell> 
minishell> 'PWD'
PWD :command not found
minishell> 
minishell> "PWD"
PWD :command not found
minishell> 
minishell> echo "-nnnnn "
-nnnnn 
minishell> 
minishell> ECHO -nn
ECHO :command not found
minishell> 
minishell> ECHO -n -n
ECHO :command not found
minishell> 
minishell> ECHO "-"""n""n""n""n""n""nnnnnn-n
ECHO :command not found
minishell> 
minishell> ECHO "-"""n""n""n""n""n""nnnnnn -n
ECHO :command not found
minishell> 
minishell> export T=nnnnnnnn
minishell> echo "-""$T"nnnnnnnnnnnnn -nnnnnnnn"$T" '-'"$T"
minishell> 
minishell> export T=nnnnnnnn
minishell> echo "-""$T"nnnnnnnnnnnnn -nnnnnnnn"$T" '-''$T'
-$Tminishell> 
minishell> export T=nnnnnnnn
minishell> echo "-"'$T'nnnnnnnnnnnnn -nnnnnnnn'$T' '-'"$T "
-$Tnnnnnnnnnnnnn -nnnnnnnn$T -nnnnnnnn 
minishell> 
minishell> export T=nnnnnnnn
minishell> echo "-"'$T'nnnnnnnnnnnnn -nnnnnnnn$T '-''$T '
-$Tnnnnnnnnnnnnn -nnnnnnnnnnnnnnnn -$T 
minishell> 
minishell> export T=e E=c S=h L=o
minishell> $T$E$S$L

minishell> 
minishell> export T=e E=c S=h L=o L=ok
minishell> $T$E$S$L
echok :command not found
minishell> 
minishell> export T=e E=c S=h L=o
minishell> $T$E$S$L -n
minishell> 
minishell> export T=E E=c S=h L=o
minishell> $T$E$S$L -n
Echo :command not found
minishell> 
minishell> export T=E E=c S=h L=o
minishell> $T$E$S$L -nn
Echo :command not found
minishell> 
minishell> export T=e E=c S=h L=o
minishell> $T$E$S$L -nn
minishell> 
minishell> export T=e E=c S=h L=o
minishell> $T$E"c"$L -nn
ecco :command not found
minishell> 
minishell> export T=e E=c S=h L=o
minishell> $T$E"C"$L -nn
ecCo :command not found
minishell> 
minishell> export T=e E=c S=h L=o
minishell> $T$E"C"$L "" -""n
ecCo :command not found
minishell> 
minishell> $NOVAR
 :command not found
minishell> 
minishell> export T="s"
minishell> l$T
Makefile
builtins
comant.txt
creat_tree.c
creat_tree.o
execution
helper
libft
main.c
main.o
minishell
minishell.h
nodes.c
nodes.o
output.txt
print_tree.c
print_tree.o
test_env.c
test_env.o
minishell> 
minishell> export T="s"
minishell> l$T -a
.
..
.DS_Store
.git
Makefile
builtins
comant.txt
creat_tree.c
creat_tree.o
execution
helper
libft
main.c
main.o
minishell
minishell.h
nodes.c
nodes.o
output.txt
print_tree.c
print_tree.o
test_env.c
test_env.o
minishell> 
minishell> export T="l"
minishell> $Ts
 :command not found
minishell> 
minishell> export T="l"
minishell> $Ts -a
 :command not found
minishell> 
minishell> LS
LS :command not found
minishell> 
minishell> Ls
Ls :command not found
minishell> 
minishell> lS
lS :command not found
minishell> 
minishell> ls
Makefile
builtins
comant.txt
creat_tree.c
creat_tree.o
execution
helper
libft
main.c
main.o
minishell
minishell.h
nodes.c
nodes.o
output.txt
print_tree.c
print_tree.o
test_env.c
test_env.o
minishell> 
minishell> PWD
PWD :command not found
minishell> 
minishell> pWD
pWD :command not found
minishell> 
minishell> pwd
/workspaces/Minishel
minishell> 
minishell> pwD
pwD :command not found
minishell> 
minishell> ENV
ENV :command not found
minishell> 
minishell> CAT
CAT :command not found
minishell> 
minishell> EXPORT
EXPORT :command not found
minishell> 
minishell> export T="|"
minishell> echo segfault $T grep segfault
segfault | grep segfault
minishell> 
minishell> export T='|'
minishell> echo segfault $T grep segfault
segfault | grep segfault
minishell> 
minishell> export T=">"
minishell> echo segfault $T grep segfault
segfault > grep segfault
minishell> 
minishell> export T='<'
minishell> echo segfault $T grep segfault
segfault < grep segfault
minishell> 
minishell> export T="<<"
minishell> echo segfault $T grep segfault
segfault << grep segfault
minishell> 
minishell> export T='<<'
minishell> echo segfault $T grep segfault
segfault << grep segfault
minishell> 
minishell> export T="|"
minishell> $T$T$T$T$T$T$T
||||||| :command not found
minishell> 
minishell> export T="echo segfault | grep segfault"
minishell> $T
echo segfault | grep segfault :command not found
minishell> 
minishell> export T=-nnnnnnnn"nnnnnnn "
minishell> echo $T
-nnnnnnnnnnnnnnn 
minishell> 
minishell> export T=-"n                    "
minishell> Echo $T
Echo :command not found
minishell> 
minishell> EXIT 123
EXIT :command not found
minishell> 
minishell> Exit
Exit :command not found
minishell> 
minishell> UNSET USER
UNSET :command not found
minishell> 
minishell> Unset USER
Unset :command not found
minishell> 
minishell> EXPORT T=LA
EXPORT :command not found
minishell> echo $T
-n                    
minishell> 
minishell> Export T=LA
Export :command not found
minishell> echo $T
-n                    
minishell> 
minishell> "e"'x''p''o''r''t' L=T
minishell> echo $T
-n                    
minishell> 
minishell> e""""""""""""cho

minishell> 
minishell> export T='|'
minishell> echo $T echo lala $T echo $T echo ?
| echo lala | echo | echo ?
minishell> 
minishell> export T="<<"
minishell> $T.
<<. :command not found
minishell> 
minishell> OLDPWD
OLDPWD :command not found
minishell> 
minishell> USER
USER :command not found
minishell> 
minishell> " ls"
 ls :command not found
minishell> 
minishell> " cat"
 cat :command not found
minishell> 
minishell> " echo"
 echo :command not found
minishell> 
minishell> " PWD"
 PWD :command not found
minishell> 
minishell> " pwd"
 pwd :command not found
minishell> 
minishell> "PWD "
PWD  :command not found
minishell> 
minishell> "pwd "
pwd  :command not found
minishell> 
minishell> 'pwd '
pwd  :command not found
minishell> 
minishell> p""''''w''''''""""""''''''''''''''''''''''''''''''''d
/workspaces/Minishel
minishell> 
minishell> '''''''''''''''' echo ok
 :command not found
minishell> 
minishell>            ''echo ok
ok
minishell> 
minishell>            ""echo ok
ok
minishell> 
minishell>            ""echo"" ok
echook :command not found
minishell> 
minishell>            ""'echo'"" ok
ok
minishell> 
minishell> echo "         |       "  | echo maybe
maybe
minishell> 
minishell> echo "|"  | echo maybe
maybe
minishell> 
minishell> echo '|'  | echo maybe
maybe
minishell> 
minishell> echo -nnnnnnnnnnnn
minishell> 
minishell> export L=amazing L=ok L=cool
minishell> echo $L
cool
minishell> 
minishell> export L=amazing L=ok L=cool
minishell> export L=ok
minishell> echo $L
ok
minishell> 
minishell> echo '$'$'$'$'$'
$$$$$
minishell> 
minishell> echo '$'$'$'$'$'$'$'
$$$$$$$
minishell> 
minishell> echo "$"$'$'$"$"$"$"$'$'
$$$$$$$$$
minishell> 
minishell> echo $/ $/ 
$/ $/
minishell> 
minishell> echo $U/SER
/SER
minishell> 
minishell> echo "$/ $/"
$/ $/
minishell> 
minishell> echo $/"$/"
$/$/
minishell> 
minishell> echo '$/'
$/
minishell> 
minishell> exit 9223372036854775805
